[
    {
        "toyId": 1,
        "toyName": "Lego Classic Bricks",
        "sellerName": "Toys R Us Local",
        "sellerEmail": "contact@toysruslocal.com",
        "price": 49.99,
        "rating": 4.7,
        "availableQuantity": 75,
        "description": "The Lego Classic Bricks set is one of the most timeless and creative toys ever designed for children and families. It comes with a rich assortment of colorful blocks, wheels, windows, and unique shapes that encourage endless imagination. Kids can build houses, cars, castles, animals, and whatever their creativity sparks. The set helps children enhance their motor skills, problem-solving abilities, and patience as they plan and assemble their ideas. Each piece is made from durable, child-safe plastic that ensures long-lasting fun. Parents appreciate that Lego Classic sets are not just about play—they promote collaboration, innovation, and cognitive development. Whether played alone or with friends, this toy helps foster creativity and teamwork. The instructions included offer a few ideas, but the real fun begins when kids experiment on their own. Perfect for ages 4 and up, the Lego Classic Bricks set is more than just a toy—it’s a foundation for imaginative learning and limitless construction possibilities that can keep kids entertained for hours or even days.",
        "pictureURL": "https://i.ibb.co.com/DgGm7VCL/lego.jpg",
        "subCategory": "Board & Family Games"
    },
    {
        "toyId": 2,
        "toyName": "Hot Wheels Mega Garage",
        "sellerName": "Speedy Toy Shop",
        "sellerEmail": "support@speedytoys.com",
        "price": 39.99,
        "rating": 4.6,
        "availableQuantity": 60,
        "description": "The Hot Wheels Mega Garage is the ultimate playset for car enthusiasts and young speed lovers. Designed with multiple levels, elevators, and ramps, this garage provides an exciting playground for dozens of miniature cars. Kids can race their vehicles, park them, or send them flying through loops for thrilling adventures. The realistic design includes sound effects, bright colors, and movable parts that bring each play session to life. Parents love how it encourages imaginative storytelling and role-playing, allowing children to act as mechanics, racers, or city planners. The durable plastic construction ensures long-lasting use, even during intense racing sessions. It’s not just a toy—it’s a miniature world of excitement that teaches kids organization, cause and effect, and basic engineering concepts. Whether playing alone or with friends, the Hot Wheels Mega Garage sparks endless creativity, offering a perfect mix of entertainment and learning. With room for more than 30 cars, it’s a must-have for any Hot Wheels collector or budding racer.",
        "pictureURL": "https://i.ibb.co.com/jkbQjhRB/garage.jpg",
        "subCategory": "Vehicles & Tracks"
    },
    {
        "toyId": 3,
        "toyName": "Barbie Dreamhouse",
        "sellerName": "Doll Haven",
        "sellerEmail": "sales@dollhaven.com",
        "price": 129.99,
        "rating": 4.8,
        "availableQuantity": 40,
        "description": "The Barbie Dreamhouse is a spectacular multi-story playset that brings Barbie’s glamorous lifestyle to life. This detailed mansion features three luxurious floors, seven furnished rooms, a working elevator, and even a rooftop pool. Children can role-play endless scenarios—from cooking in the kitchen to relaxing in the living room or hosting a party by the pool. Each area is intricately designed with vibrant colors, textures, and accessories that spark storytelling and creativity. The Dreamhouse promotes cooperative play and helps children build social and communication skills. Made from high-quality, safe plastic, it’s durable enough for years of imaginative play. With over 70 accessories included, the Dreamhouse allows kids to design, decorate, and explore their dream world. The design also encourages fine motor skills and creative thinking. Whether used with Barbie dolls or other mini figures, this iconic toy inspires dreams and endless adventures, making it a treasured centerpiece for any young dreamer’s playroom.",
        "pictureURL": "https://i.ibb.co.com/yJQFfKW/barbie.jpg",
        "subCategory": "Board & Family Games"
    },
    {
        "toyId": 4,
        "toyName": "Nerf Elite Blaster Set",
        "sellerName": "Action Kids Store",
        "sellerEmail": "contact@actionkids.com",
        "price": 59.99,
        "rating": 4.5,
        "availableQuantity": 90,
        "description": "The Nerf Elite Blaster Set is a must-have for adventure-loving kids who enjoy active play. Equipped with precision-engineered foam darts, this set delivers both power and accuracy in every shot. The ergonomic grip and lightweight design make it comfortable for long play sessions indoors or outdoors. Kids can compete in friendly battles, improve hand-eye coordination, and develop quick reflexes. Each blaster features a tactical rail system, allowing attachments like scopes or dart holders. Parents appreciate the soft foam darts that ensure safety during energetic matches. The set encourages physical activity, teamwork, and fair play. Its durable plastic body is built to withstand rough handling, and the quick-reload mechanism keeps the action fast-paced. Whether used in the backyard or at a Nerf party, the Elite Blaster Set promises thrilling fun and safe competition for kids and teens alike. It’s an exciting combination of action, strategy, and play that fuels energy and imagination.",
        "pictureURL": "https://i.ibb.co.com/yBqrqpYz/Nerf-Elite.jpg",
        "subCategory": "Board & Family Games"
    },
    {
        "toyId": 5,
        "toyName": "Fisher-Price Learning Robot",
        "sellerName": "Smart Play BD",
        "sellerEmail": "info@smartplaybd.com",
        "price": 54.99,
        "rating": 4.9,
        "availableQuantity": 50,
        "description": "The Fisher-Price Learning Robot is an interactive educational companion for toddlers, designed to make learning fun and engaging. This smart robot responds to touch, sound, and motion with cheerful lights, songs, and movements. It introduces kids to letters, numbers, colors, and basic problem-solving through entertaining games and music. Parents love how it promotes curiosity and early learning in a playful environment. The robot’s colorful LED face changes expressions, making interactions lively and expressive. Built with safe materials, it’s sturdy enough to handle daily play. It also encourages physical activity as kids dance along with its rhythms. The robot grows with your child, offering multiple levels of learning that adapt to different ages. Its voice prompts and cheerful responses create a sense of companionship, making learning a delightful experience. This toy doesn’t just teach facts—it inspires curiosity, imagination, and confidence in young learners, giving them a playful start in the world of technology and education.",
        "pictureURL": "https://i.ibb.co.com/h1R4291G/fisher.webp",
        "subCategory": "Vehicles & Tracks"
    },
    {
        "toyId": 6,
        "toyName": "Play-Doh Super Color Pack",
        "sellerName": "Crafty Kids Shop",
        "sellerEmail": "hello@craftykids.com",
        "price": 24.99,
        "rating": 4.6,
        "availableQuantity": 120,
        "description": "The Play-Doh Super Color Pack is a creative dream for children who love to mold, shape, and design their imaginations into colorful reality. With a vibrant range of colors, this set offers endless possibilities for sculpting fun. Kids can create animals, food, letters, and anything else they imagine. The soft, non-toxic compound is safe for small hands and easy to clean. Parents appreciate how it encourages fine motor development, color recognition, and creative thinking. Teachers also find it useful for classroom projects, art activities, and sensory play. Each tub comes sealed to preserve freshness, ensuring hours of mess-free fun. It’s perfect for group play, birthday parties, or quiet afternoons at home. The Play-Doh Super Color Pack helps kids express themselves while strengthening patience and focus. It’s more than just dough—it’s a tool for storytelling, learning, and imagination. With its iconic scent and texture, this classic toy continues to inspire generations of creators worldwide.",
        "pictureURL": "https://i.ibb.co.com/LzQgHJNJ/playDoh.jpg",
        "subCategory": "Arts & Crafts"
    },
    {
        "toyId": 7,
        "toyName": "Jenga Classic Stack Game",
        "sellerName": "Family Fun Toys",
        "sellerEmail": "support@familyfun.com",
        "price": 19.99,
        "rating": 4.8,
        "availableQuantity": 110,
        "description": "Jenga Classic is the ultimate test of patience, precision, and steady hands. This iconic stacking game challenges players to remove and balance wooden blocks without toppling the tower. The rules are simple, yet the tension and excitement rise with every move. It’s a perfect family game that builds concentration, strategy, and teamwork. The smooth wooden blocks are crafted from high-quality hardwood, making them durable and satisfying to handle. Jenga is not only fun but also educational—it helps children develop fine motor control, focus, and problem-solving skills. Each game is unique, offering endless replay value. It’s portable, easy to set up, and great for parties or family nights. The laughter and suspense make Jenga a timeless favorite for kids and adults alike. Whether played competitively or casually, it brings people together in moments of joy, learning, and friendly challenge that never grow old.",
        "pictureURL": "https://i.ibb.co.com/rKTqdfck/janga.jpg",
        "subCategory": "Board & Family Games"
    },
    {
        "toyId": 8,
        "toyName": "Melissa & Doug Wooden Train Set",
        "sellerName": "Classic Toys BD",
        "sellerEmail": "sales@classictoysbd.com",
        "price": 69.99,
        "rating": 4.9,
        "availableQuantity": 45,
        "description": "The Melissa & Doug Wooden Train Set is a beautiful combination of craftsmanship, learning, and imaginative play. This premium wooden railway set features interlocking tracks, colorful engines, and multiple accessories like bridges, tunnels, and trees. Children can design and redesign their train routes, enhancing creativity and spatial awareness. Made from sustainable wood with non-toxic paints, the set ensures safety and durability. It’s perfect for developing problem-solving skills and hand-eye coordination while encouraging cooperative play. Parents love that it keeps kids engaged for hours without screens or batteries. The realistic magnetic connectors make it easy for little hands to attach train cars, promoting fine motor development. The timeless design blends nostalgia with educational fun, making it a great gift for both boys and girls. As kids grow, they can expand their train world by adding new tracks or vehicles. It’s a toy that inspires adventure, creativity, and a lifelong love for building and exploring.",
        "pictureURL": "https://i.ibb.co.com/qLm6wgfK/melisia.jpg",
        "subCategory": "Vehicles & Tracks"
    },
    {
        "toyId": 9,
        "toyName": "Crayola Ultimate Art Case",
        "sellerName": "Art Planet",
        "sellerEmail": "info@artplanet.com",
        "price": 44.99,
        "rating": 4.8,
        "availableQuantity": 80,
        "description": "The Crayola Ultimate Art Case is the perfect gift for every aspiring young artist. Packed with crayons, colored pencils, washable markers, and sheets of paper, it provides everything a child needs to explore their artistic side. The sturdy carrying case keeps everything organized and portable, ideal for travel or school projects. Each color is vibrant and easy to blend, allowing kids to experiment with shading, drawing, and coloring techniques. Parents love that all materials are non-toxic and washable, ensuring safe and mess-free creativity. This art kit helps kids develop fine motor skills, hand-eye coordination, and imagination while encouraging self-expression. Whether they’re sketching animals, drawing superheroes, or designing their dream home, the possibilities are endless. The Crayola Ultimate Art Case inspires confidence and pride in every masterpiece. It’s not just an art set—it’s a creative journey that helps children build patience, focus, and a lifelong love for artistic discovery.",
        "pictureURL": "https://i.ibb.co.com/dsSbs2C4/easel-set.jpg",
        "subCategory": "Arts & Crafts"
    },
    {
        "toyId": 10,
        "toyName": "Paw Patrol Rescue Vehicle",
        "sellerName": "Kid Heroes Store",
        "sellerEmail": "contact@kidheroes.com",
        "price": 34.99,
        "rating": 4.7,
        "availableQuantity": 95,
        "description": "The Paw Patrol Rescue Vehicle brings children’s favorite characters to life with action-packed fun and adventure. Each vehicle comes with a movable rescue feature and an exclusive figure of a beloved Paw Patrol pup. Kids can recreate their favorite missions from the TV show or invent new rescues of their own. The durable design ensures long-lasting play, while the bright colors and realistic details make every mission exciting. Parents appreciate that this toy encourages storytelling, problem-solving, and empathy as kids act out helping others. It also promotes teamwork and imaginative play when shared with friends. Collecting all the characters adds even more excitement, allowing kids to build their own Paw Patrol world. Designed for preschoolers, it’s easy to handle and safe for small hands. Whether saving the day from fire, water, or snow, this rescue vehicle teaches courage, friendship, and creativity—all while providing hours of engaging entertainment.",
        "pictureURL": "https://i.ibb.co.com/sJMBdsQX/recsue-vehicle.jpg",
        "subCategory": "Vehicles & Tracks"
    },
    {
        "toyId": 11,
        "toyName": "Monopoly Junior Board Game",
        "sellerName": "FunHouse Toys",
        "sellerEmail": "info@funhousetoys.com",
        "price": 29.99,
        "rating": 4.5,
        "availableQuantity": 85,
        "description": "Monopoly Junior is a simplified version of the world-famous board game designed especially for younger players. It introduces kids to basic math, decision-making, and financial concepts in a playful, easy-to-understand way. The colorful board features child-friendly locations like amusement parks and ice cream parlors, making it fun and relatable. Kids can buy, sell, and trade properties, learning valuable lessons about money management and strategy. The game encourages social interaction, patience, and fair play while keeping everyone entertained for hours. Parents love how it brings the family together for quality time away from screens. The components are sturdy, safe, and designed for repeated use. Monopoly Junior is not just a game—it’s an educational adventure that combines laughter with learning, helping children develop confidence and basic economic understanding through play.",
        "pictureURL": "https://i.ibb.co.com/xKS49Qt4/monopoly.jpg",
        "subCategory": "Board & Family Games"
    },
    {
        "toyId": 12,
        "toyName": "Ravensburger 3D Puzzle Globe",
        "sellerName": "Brainy Kids Hub",
        "sellerEmail": "hello@brainykids.com",
        "price": 52.99,
        "rating": 4.9,
        "availableQuantity": 55,
        "description": "The Ravensburger 3D Puzzle Globe is a fascinating and educational puzzle that brings geography to life in an interactive way. Unlike traditional flat puzzles, this globe consists of curved pieces that fit together perfectly to form a smooth, solid sphere. Each country is vividly illustrated, helping children learn about continents, oceans, and landmarks as they assemble it. The sturdy plastic pieces click together without glue, creating a durable model that can stand on its own base once completed. Parents and teachers love how it combines hands-on creativity with real-world learning. Building the globe enhances patience, spatial awareness, and memory, while fostering a deeper curiosity about the world. It’s perfect for solo play or family activity time. Once finished, the globe can serve as both a decoration and a learning tool. This puzzle goes beyond entertainment—it nurtures a love for discovery, geography, and mindful focus in every young explorer.",
        "pictureURL": "https://i.ibb.co.com/hxqSFsfN/puzzle.jpg",
        "subCategory": "Educational Toys"
    }
]
